Revit 2024 API
BuiltInFailures.StairRampFailures.StairsAreUpdatedDueToLevelHeightChange Property
 Stair component(s) in the multistory stair are updated due to the level height changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsAreUpdatedDueToLevelHeightChange { get; }
Visual Basic
Public Shared ReadOnly Property StairsAreUpdatedDueToLevelHeightChange As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsAreUpdatedDueToLevelHeightChange {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace